/**
 * Created by gaochao on 9/21/17.
 */
/*测试Code*/
/*
 (function () {
 window.page = "101006";
 var gas = document.createElement("script");
 gas.type = "text/javascript";
 gas.async = true;
 gas.src = "http://" + window.location.host + "/js/gas.js";

 var l = document.getElementsByTagName("script").length;
 var g = document.getElementsByTagName("script")[l - 1];
 g.parentNode.insertBefore(gas, g);
 })();
 */
(function (w) {
    w = w || this;
    //主对象
    var main = {}, db = {}, map = {}, el = {}, op = {
        page: "",
        v: "1.0"
    };
    //获取页面id
    op.page = window.page;
    var extend = function (o, n) {
        for (var p in n)
            if (n.hasOwnProperty(p) && !o.hasOwnProperty(p))
                o[p] = n[p];
    };
    var isArray = function (obj) {
        return Object.prototype.toString.call(obj) === '[object Array]';
    }
    var arrExtend = function (s, o) {
        if (isArray(s) && isArray(o)) {
            var l = o.length;
            for (var i = 0; i < l; i++) {
                if (o[i]) {
                    s.push(o[i]);
                }
            }
            return o;
        }
        else {
            return [];
        }
    };
    //获取操作对象
    map.get = function (element) {
        var num = element.getAttribute("num");
        if (num) {
            var length = num.length;
            var index = num.indexOf('-');
            var index1 = num.lastIndexOf('-');
            var specialMk = "";
            if (index1) {
                specialMk = num.substring(0, index1);
            }
            num = el.dealSpecialElement(num, element);
            var mk = num.substring(0, index);
            var sort = num.substring(index1 + 1, length);
            var data = map.mapping[op.page][mk];
            //特别模块处理
            //购物车-列表
            if (mk == "202049") {
                if (sort % 2 == 0) {
                    num = mk + "-2";
                }
                else {
                    num = mk + "-1";
                }
            }
            //发票内容
            if (mk == "202060") {
                if (sort >= 5) {
                    num = mk + "-input-5";
                }
            }
            //订单详情物流详情
            if (mk == "202073") {
                if (sort == 1) {
                    num = mk + "-1";
                }
            }
            //订单列表操作
            if (mk == "202070" || mk == "202072") {
                var operate = element.getAttribute("operate");
                if (operate) {
                    //取消订单
                    if (operate == "cancelorder") {
                        num = mk + "-2";
                    }
                    //支付订单
                    if (operate == "payorder") {
                        num = mk + "-3";
                    }
                    //物流信息（快递信息）
                    if (operate == "expressorder") {
                        num = mk + "-4";
                    }
                    //订单退款（电话退款）
                    if (operate == "refundorder") {
                        num = mk + "-5";
                    }
                    //确认收货
                    if (operate == "deliveredorder") {
                        num = mk + "-6";
                    }
                    //删除订单
                    if (operate == "deleteorder") {
                        num = mk + "-7";
                    }
                }
                else {
                    num = mk + "-1";
                }
            }
            //我的收藏,我的浏览,地址列表
            if (mk == "202058" || mk == "202040" || mk == "202043") {
                var y = sort % 3;
                if (y == 0) {
                    num = mk + "-3";
                }
                if (y == 1) {
                    num = mk + "-1";
                }
                if (y == 2) {
                    num = mk + "-2";
                }
            }
            for (var i in data) {
                var d = data[i];

                if (d.a == mk) {
                    return d;
                }
                if (d.a == specialMk) {
                    return d;
                }
                if (d.a == num) {
                    return d;
                }
            }
        }
        return "";
    };
    //地图
    //k操作id，v操作名称,a为页面埋点Id
    map.mapping = {
        //通用 首页和模板页
        "200000": {
            //头部-顶部
            "202001": [
                { k: "w22001", v: "收藏", a: "202001-1" },
                { k: "w22002", v: "首页", a: "202001-2" },
                { k: "w22003", v: "用户名称（点击）", a: "202001-3" },
                { k: "w22004", v: "用户退出", a: "202001-4" },
                { k: "w22005", v: "购物车", a: "202001-5" },
                { k: "w22006", v: "我的家有", a: "202001-6" },
                { k: "w22007", v: "可用优惠劵", a: "202001-7" },
                { k: "w22008", v: "我的收藏", a: "202001-8" },
                { k: "w22009", v: "手机版", a: "202001-9" },
                { k: "w22010", v: "微信版", a: "202001-10" },
            ],
            //头部-搜索
            "202002": [
                { k: "w22011", v: "Logo", a: "202002-1" },
                { k: "w22012", v: "搜索按钮", a: "202002-2" },
                { k: "w22023", v: "我的购物车", a: "202002-3" },
            ],
            //头部-搜索-热词
            "202005": [
                { k: "w22013", v: "热词1", a: "202005-1" },
                { k: "w22014", v: "热词2", a: "202005-2" },
                { k: "w22015", v: "热词3", a: "202005-3" },
                { k: "w22016", v: "热词4", a: "202005-4" },
                { k: "w22017", v: "热词5", a: "202005-5" },
                { k: "w22018", v: "热词6", a: "202005-6" },
                { k: "w22019", v: "热词7", a: "202005-7" },
                { k: "w22020", v: "热词8", a: "202005-8" },
                { k: "w22021", v: "热词9", a: "202005-9" },
                { k: "w22022", v: "热词10", a: "202005-10" },
            ],
            //分类
            "202011": [
                { k: "w1114", v: "点击厨房用品", a: "202011-1" },
                { k: "w1115", v: "点击生活居家", a: "202011-2" },
                { k: "w1116", v: "点击厨房电器", a: "202011-3" },
                { k: "w1117", v: "点击家纺用品", a: "202011-4" },
                { k: "w1118", v: "点击服装服饰", a: "202011-5" },
                { k: "w1119", v: "点击美容护肤", a: "202011-6" },
                { k: "w1120", v: "点击生活电器", a: "202011-7" },
                { k: "w1121", v: "点击箱包配饰", a: "202011-8" },
                { k: "w1122", v: "点击运动健康", a: "202011-9" },
                { k: "w1123", v: "点击视频饮料", a: "202011-10" },
            ],
            //功能菜单
            "202012": [
                { k: "w22036", v: "首页", a: "202012-1" },
                { k: "w22037", v: "TV直播", a: "202012-2" },
                { k: "w22038", v: "品牌汇", a: "202012-3" },
                { k: "w22039", v: "海外购", a: "202012-4" },
                { k: "w22040", v: "惠家有APP", a: "202012-5" },
                { k: "w22041", v: "家有尊享", a: "202012-6" },
            ],
            //首页轮播图
            "4497471600010001": [
                { k: "w1269", v: "首页-点击轮播图1", a: "4497471600010001-1" },
                { k: "w1270", v: "首页-点击轮播图2", a: "4497471600010001-2" },
                { k: "w1271", v: "首页-点击轮播图3", a: "4497471600010001-3" },
                { k: "w1272", v: "首页-点击轮播图4", a: "4497471600010001-4" },
                { k: "w1273", v: "首页-点击轮播图5", a: "4497471600010001-5" },
                { k: "w1274", v: "首页-点击轮播图6", a: "4497471600010001-6" },
                { k: "w1275", v: "首页-点击轮播图7", a: "4497471600010001-7" },
                { k: "w1276", v: "首页-点击轮播图8", a: "4497471600010001-8" },
                { k: "w1277", v: "首页-点击轮播图9", a: "4497471600010001-9" },
                { k: "w1278", v: "首页-点击轮播图10", a: "4497471600010001-10" },
                { k: "w1279", v: "首页-点击轮播图11", a: "4497471600010001-11" },
                { k: "w1280", v: "首页-点击轮播图12", a: "4497471600010001-12" },
                { k: "w1281", v: "首页-点击轮播图13", a: "4497471600010001-13" },
                { k: "w1282", v: "首页-点击轮播图14", a: "4497471600010001-14" },
                { k: "w1283", v: "首页-点击轮播图15", a: "4497471600010001-15" },
            ],
            //限时抢购
            "4497471600010011": [
                { k: "w1294", v: "首页-点击限时抢购位置1", a: "4497471600010011-2" },
                { k: "w1295", v: "首页-点击限时抢购位置2", a: "4497471600010011-3" },
                { k: "w1296", v: "首页-点击限时抢购位置3", a: "4497471600010011-4" },
                { k: "w1297", v: "首页-点击限时抢购更多", a: "4497471600010011-1" },
                //新增
                { k: "w22042", v: "首页-点击限时抢购位置4", a: "4497471600010011-5" },
                { k: "w22043", v: "首页-点击限时抢购位置5", a: "4497471600010011-6" },
                { k: "w22044", v: "首页-点击限时抢购位置-上一页", a: "4497471600010011-7" },
                { k: "w22045", v: "首页-点击限时抢购位置-下一页", a: "4497471600010011-8" },
            ],
            //TV直播
            "4497471600010010": [
                { k: "w1299", v: "首页-点击TV直播商品1商品名称点击", a: "4497471600010010-2" },
                { k: "w1300", v: "首页-点击TV直播商品2商品名称点击", a: "4497471600010010-3" },
                { k: "w1301", v: "首页-点击TV直播商品3商品名称点击", a: "4497471600010010-4" },
                { k: "w1302", v: "首页-点击TV直播商品4商品名称点击", a: "4497471600010010-5" },
                { k: "w1303", v: "首页-点击TV直播商品5商品名称点击", a: "4497471600010010-6" },
                { k: "w1304", v: "首页 - 点击TV直播更多", a: "4497471600010010-1" },
                //新增
                { k: "w22046", v: "首页 - 点击TV直播-上一页", a: "4497471600010010-7" },
                { k: "w22047", v: "首页 - 点击TV直播-下一页", a: "4497471600010010-8" },
            ],
            //一栏推荐
            "4497471600010005": [
                { k: "w1305", v: "首页-点击模板一图片", a: "4497471600010005-2" },
                { k: "w1306", v: "首页-点击模板一更多", a: "4497471600010005-1" },
            ],
            //商品推荐
            "4497471600010008": [
                { k: "w1315", v: "首页-点击模板四位置1", a: "4497471600010008-2" },
                { k: "w1316", v: "首页-点击模板四位置2", a: "4497471600010008-3" },
                { k: "w1317", v: "首页-点击模板四位置3", a: "4497471600010008-4" },
                { k: "w1318", v: "首页-点击模板四位置4", a: "4497471600010008-5" },
                { k: "w1319", v: "首页-点击模板四位置5", a: "4497471600010008-6" },
                { k: "w1335", v: "首页-点击模板四更多", a: "4497471600010008-1" },
                //新增
                { k: "w22048", v: "首页-点击模板四-上一页", a: "4497471600010008-7" },
                { k: "w22049", v: "首页-点击模板四-下一页", a: "4497471600010008-8" },
            ],
            //一栏广告
            "4497471600010002": [
                { k: "w1335", v: "首页-点击模板六", a: "4497471600010002" },
            ],
            //猜你喜欢
            "202006": [
                { "k": "w1679", "v": "点击猜你喜欢位置1", "a": "202006-1" },
                { "k": "w1680", "v": "点击猜你喜欢位置2", "a": "202006-2" },
                { "k": "w1681", "v": "点击猜你喜欢位置3", "a": "202006-3" },
                { "k": "w1682", "v": "点击猜你喜欢位置4", "a": "202006-4" },
                { "k": "w1683", "v": "点击猜你喜欢位置5", "a": "202006-5" },
                //新增
                { "k": "w22050", "v": "点击猜你喜欢位置-上一页", "a": "202006-4" },
                { "k": "w22051", "v": "点击猜你喜欢位置-下一页", "a": "202006-5" },
            ],
            //公共底部
            "202050": [
                { "k": "w22231", "v": "首页底部-点击关于我们", "a": "202050-1" },
                { "k": "w22232", "v": "首页底部-点击公司介绍", "a": "202050-2" },
                { "k": "w22233", "v": "首页底部-点击新闻报道", "a": "202050-3" },
                { "k": "w22234", "v": "首页底部-点击招聘信息", "a": "202050-4" },
                { "k": "w22235", "v": "首页底部-点击联系我们", "a": "202050-5" },
                { "k": "w22236", "v": "首页底部-点击订购指南", "a": "202050-6" },
                { "k": "w22237", "v": "首页底部-点击交易条款", "a": "202050-7" },
                { "k": "w22238", "v": "首页底部-点击注册/购物流程", "a": "202050-8" },
                { "k": "w22239", "v": "首页底部-点击退\换货", "a": "202050-9" },
                { "k": "w22240", "v": "首页底部-点击积分说明", "a": "202050-10" },
                { "k": "w22241", "v": "首页底部-点击发票指南", "a": "202050-11" },
                { "k": "w22242", "v": "首页底部-点击会员制度说明", "a": "202050-12" },
                { "k": "w22243", "v": "首页底部-点击配送服务", "a": "202050-13" },
                { "k": "w22244", "v": "首页底部-点击配送方式", "a": "202050-14" },
                { "k": "w22245", "v": "首页底部-点击配送区域", "a": "202050-15" },
                { "k": "w22246", "v": "首页底部-点击配送时间", "a": "202050-16" },
                { "k": "w22247", "v": "首页底部-点击免费配送", "a": "202050-17" },
                { "k": "w22248", "v": "首页底部-点击限时送达", "a": "202050-18" },
                { "k": "w22249", "v": "首页底部-点击验货与签收", "a": "202050-19" },
                { "k": "w22250", "v": "首页底部-点击支付方式", "a": "202050-20" },
                { "k": "w22251", "v": "首页底部-点击网上支付", "a": "202050-21" },
                { "k": "w22252", "v": "首页底部-点击货到付款", "a": "202050-22" },
                { "k": "w22253", "v": "首页底部-点击银行汇款", "a": "202050-23" },
                { "k": "w22254", "v": "首页底部-点击家有卡", "a": "202050-24" },
                { "k": "w22255", "v": "首页底部-点击合作专区", "a": "202050-25" },
                { "k": "w22256", "v": "首页底部-点击成为供应商", "a": "202050-26" },
                { "k": "w22257", "v": "首页底部-点击供应商系统", "a": "202050-27" },
                { "k": "w22258", "v": "首页底部-点击合作伙伴", "a": "202050-28" },

                { "k": "w22259", "v": "首页底部-点击关于家有", "a": "202050-29" },
                { "k": "w22260", "v": "首页底部-点击媒体关注", "a": "202050-30" },
                { "k": "w22261", "v": "首页底部-点击联系我们", "a": "202050-31" },
                { "k": "w22262", "v": "首页底部-点击诚聘英才", "a": "202050-32" },
                { "k": "w22263", "v": "首页底部-点击校园招聘", "a": "202050-33" },
                { "k": "w22264", "v": "首页底部-点击全部品牌", "a": "202050-34" },
                { "k": "w22265", "v": "首页底部-点击投诉建议", "a": "202050-35" },

                { "k": "w22266", "v": "首页底部-点击家有购物集团", "a": "202050-36" },
                //底部图片
                { "k": "w22267", "v": "首页底部-点击", "a": "202050-37" },
                { "k": "w22268", "v": "首页底部-点击", "a": "202050-38" },
                { "k": "w22269", "v": "首页底部-点击", "a": "202050-39" },
                { "k": "w22270", "v": "首页底部-点击", "a": "202050-40" },
                { "k": "w22271", "v": "首页底部-点击", "a": "202050-41" },
                { "k": "w22272", "v": "首页底部-点击", "a": "202050-42" },
                { "k": "w22273", "v": "首页底部-点击", "a": "202050-43" },
                { "k": "w22274", "v": "首页底部-点击", "a": "202050-44" },
                { "k": "w22275", "v": "首页底部-点击", "a": "202050-45" }
            ],
            //友情链接
            "202051": [
                { "k": "w22276", "v": "友情链接-链接点击", "a": "202051" },
            ],
            //我的菜单
            "202036": [
                { "k": "", "v": "我的菜单-点击我的主页", "a": "202036-1" },
                { "k": "w1055", "v": "我的菜单-我的订单点击", "a": "202036-2" },
                { "k": "w1507", "v": "我的菜单-点击我的收藏", "a": "202036-3" },
                { "k": "w1054", "v": "我的菜单-浏览记录点击", "a": "202036-4" },
                { "k": "p1481", "v": "我的菜单-点击我的优惠劵", "a": "202036-5" },
                { "k": "", "v": "我的菜单-点击我的储值金", "a": "202036-6" },
                { "k": "", "v": "我的菜单-点击我的暂存款", "a": "202036-7" },
                { "k": "", "v": "我的菜单-点击我的积分", "a": "202036-8" },
                { "k": "", "v": "我的菜单-点击设置个人信息", "a": "202036-9" },
                { "k": "w1484", "v": "我的菜单-点击修改密码", "a": "202036-10" },
                { "k": "w1483", "v": "我的菜单-点击编辑收货地址", "a": "202036-11" },
            ]
        },
        //首页
        "101006": {
            //topThree操作
            "202013": [
                { k: "w22024", v: "轮播上一个", a: "2020013-1" },
                { k: "w22025", v: "轮播下一个", a: "2020013-2" },
                { k: "w22026", v: "登录（未登录）", a: "2020013-3" },
                { k: "w22027", v: "免费注册（未登录）", a: "2020013-4" },
                { k: "w22028", v: "用户头像和名称（已经登录）", a: "2020013-5" },
                { k: "w22029", v: "待收货（订单）", a: "2020013-6" },
                { k: "w22030", v: "待发货（订单）", a: "2020013-7" },
                { k: "w22031", v: "待付款（订单）", a: "2020013-8" },
                { k: "w22032", v: "直播节目表", a: "2020013-9" },
                { k: "w22033", v: "掌上购物", a: "2020013-10" },
                { k: "w22034", v: "物流查询", a: "2020013-11" },
                { k: "w22035", v: "会员中心", a: "2020013-12" },
            ],
        },
        //TV直播页
        "101009": {
            //TV直播-商品列表
            "202018": [
                //TV直播页
                { "k": "w1299", "v": "点击TV直播商品1", "a": "202018-1" },
                { "k": "w1300", "v": "点击TV直播商品2", "a": "202018-2" },
                { "k": "w1301", "v": "点击TV直播商品3", "a": "202018-3" },
                { "k": "w1302", "v": "点击TV直播商品4", "a": "202018-4" },
                { "k": "w1303", "v": "点击TV直播商品5", "a": "202018-5" },
                //pc修改
                { "k": "w1304", "v": "点击TV直播上一页", "a": "202018-6" },
                //pc新增
                { "k": "w22052", "v": "点击TV直播下一页", "a": "202018-7" },
            ],
            //TV直播-立即购买
            "202015": [
                { "k": "w22053", "v": "点击TV直播轮播商品-立即购买-1", "a": "202015-1" },
                { "k": "w22054", "v": "点击TV直播轮播商品-立即购买-2", "a": "202015-2" },
                { "k": "w22055", "v": "点击TV直播轮播商品-立即购买-3", "a": "202015-3" },
                { "k": "w22056", "v": "点击TV直播轮播商品-立即购买-4", "a": "202015-4" },
                { "k": "w22057", "v": "点击TV直播轮播商品-立即购买-5", "a": "202015-5" },
            ],
            // TV直播-轮播图片集合
            "202016": [
                { "k": "w22058", "v": "点击TV直播轮播商品-商品图片-1", "a": "202016-1" },
                { "k": "w22059", "v": "点击TV直播轮播商品-商品图片-2", "a": "202016-2" },
                { "k": "w22060", "v": "点击TV直播轮播商品-商品图片-3", "a": "202016-3" },
            ],
            //TV直播-时间轴
            "202017": [
                { "k": "", "v": "点击TV直播轮-时间", "a": "202017-li" },
            ],
        },
        //登录
        "101013": {
            //登录页-操作
            "202019": [
                { "k": "w22061", "v": "登录-点击首页链接", "a": "202019-1" },
                { "k": "", "v": "登录-点击用户登录切换按钮", "a": "202019-2" },
                { "k": "", "v": "登录-点击快捷登录切换按钮", "a": "202019-3" },
                { "k": "w22062", "v": "登录-点击忘记密码", "a": "202019-4" },
                { "k": "w1001", "v": "登录-点击登录按钮", "a": "202019-5" },
                { "k": "w1002", "v": "登录-点击新用户注册", "a": "202019-6" },
                { "k": "w22062", "v": "登录-点击忘记密码", "a": "202019-7" },
                { "k": "w1003", "v": "登录-短信登录点击", "a": "202019-8" },
                { "k": "w1002", "v": "登录-点击新用户注册", "a": "202019-9" },

                //特殊
                { "k": "w1005", "v": "登录-点击获取验证码", "a": "202019-button-1" },
                { "k": "", "v": "登录-点击下次自动登录", "a": "202019-label" },
            ]
        },
        //注册
        "101003": {
            //注册页-操作
            "202020": [
                { "k": "w22063", "v": "注册页-点击会员注册协议", "a": "202020-1" },
                { "k": "w22064", "v": "注册页-点击隐私保护政策", "a": "202020-2" },
                { "k": "w1002", "v": "注册页-点击注册", "a": "202020-3" },
                { "k": "w1001", "v": "注册页-点击登录", "a": "202020-4" },
                { "k": "w22061", "v": "注册页-点击首页链接", "a": "202020-5" },

                //特殊
                { "k": "w1005", "v": "登录-点击获取验证码", "a": "202020-button-1" },
                { "k": "", "v": "登录-点击我已阅读并同意", "a": "202020-label" },
            ]
        },
        //查询列表页
        "101010": {
            //查询列表页-条件显示
            "202021": [
                { "k": "w22065", "v": "全部商品", "a": "202021-1" },
                { "k": "w22066", "v": "标识一", "a": "202021-2" },
                { "k": "w22067", "v": "标识二", "a": "202021-3" },
            ],
            //产品列表-分类筛选
            "202022": [
                { "k": "w22068", "v": "分类筛选1", "a": "202022-1" },
                { "k": "w22069", "v": "分类筛选2", "a": "202022-2" },
                { "k": "w22070", "v": "分类筛选3", "a": "202022-3" },
                { "k": "w22071", "v": "分类筛选4", "a": "202022-4" },
                { "k": "w22072", "v": "分类筛选5", "a": "202022-5" },
                { "k": "w22073", "v": "分类筛选6", "a": "202022-6" },
                { "k": "w22074", "v": "分类筛选7", "a": "202022-7" },
                { "k": "w22075", "v": "分类筛选8", "a": "202022-8" },
                { "k": "w22076", "v": "分类筛选9", "a": "202022-9" },
                { "k": "w22077", "v": "分类筛选10", "a": "202022-10" },
            ],
            //产品列表-品牌筛选
            "202023": [
                { "k": "w22078", "v": "品牌筛选1", "a": "202023-1" },
                { "k": "w22079", "v": "品牌筛选2", "a": "202023-2" },
                { "k": "w22080", "v": "品牌筛选3", "a": "202023-3" },
                { "k": "w22081", "v": "品牌筛选4", "a": "202023-4" },
                { "k": "w22082", "v": "品牌筛选5", "a": "202023-5" },
                { "k": "w22083", "v": "品牌筛选6", "a": "202023-6" },
                { "k": "w22084", "v": "品牌筛选7", "a": "202023-7" },
                { "k": "w22085", "v": "品牌筛选8", "a": "202023-8" },
                { "k": "w22086", "v": "品牌筛选9", "a": "202023-9" },
                { "k": "w22087", "v": "品牌筛选10", "a": "202023-10" },
            ],
            //产品列表-排序和价格筛选
            "202024": [
                { "k": "", "v": "商品列表页-点击价格筛选确认", "a": "202024-1" },
                //特殊
                { "k": "w1500", "v": "商品列表页-综合点击", "a": "202024-li-1" },
                { "k": "w1501", "v": "商品列表页-销量点击", "a": "202024-li-2" },
                { "k": "w1504", "v": "商品列表页-人气点击", "a": "202024-li-3" },
                { "k": "w1502", "v": "商品列表页-价格正序点击", "a": "202024-li-4-1" },
                { "k": "w1503", "v": "商品列表页-价格逆序点击", "a": "202024-li-4-2" },
            ],
            //产品列表-产品
            "202025": [
                { "k": "w22088", "v": "商品列表页-商品点击1", "a": "202025-1" },
                { "k": "w22089", "v": "商品列表页-商品点击2", "a": "202025-2" },
                { "k": "w22090", "v": "商品列表页-商品点击3", "a": "202025-3" },
                { "k": "w22091", "v": "商品列表页-商品点击4", "a": "202025-4" },
                { "k": "w22092", "v": "商品列表页-商品点击5", "a": "202025-5" },
                { "k": "w22093", "v": "商品列表页-商品点击6", "a": "202025-6" },
                { "k": "w22094", "v": "商品列表页-商品点击7", "a": "202025-7" },
                { "k": "w22095", "v": "商品列表页-商品点击8", "a": "202025-8" },
                { "k": "w22096", "v": "商品列表页-商品点击9", "a": "202025-9" },
                { "k": "w22097", "v": "商品列表页-商品点击10", "a": "202025-10" },
                { "k": "w22098", "v": "商品列表页-商品点击11", "a": "202025-11" },
                { "k": "w22099", "v": "商品列表页-商品点击12", "a": "202025-12" },
                { "k": "w22100", "v": "商品列表页-商品点击13", "a": "202025-13" },
                { "k": "w22101", "v": "商品列表页-商品点击14", "a": "202025-14" },
                { "k": "w22102", "v": "商品列表页-商品点击15", "a": "202025-15" },
                { "k": "w22103", "v": "商品列表页-商品点击16", "a": "202025-16" },
                { "k": "w22104", "v": "商品列表页-商品点击17", "a": "202025-17" },
                { "k": "w22105", "v": "商品列表页-商品点击18", "a": "202025-18" },
                { "k": "w22106", "v": "商品列表页-商品点击19", "a": "202025-19" },
                { "k": "w22107", "v": "商品列表页-商品点击20", "a": "202025-20" },
            ],
            //产品列表-分页
            "202026": [
                { "k": "w22118", "v": "商品列表页-分页-位置1", "a": "202026-1" },
                { "k": "w22119", "v": "商品列表页-分页-位置2", "a": "202026-2" },
                { "k": "w22120", "v": "商品列表页-分页-位置3", "a": "202026-3" },
                { "k": "w22121", "v": "商品列表页-分页-位置4", "a": "202026-4" },
                { "k": "w22122", "v": "商品列表页-分页-位置5", "a": "202026-5" },
                { "k": "w22123", "v": "商品列表页-分页-位置6", "a": "202026-6" },
                { "k": "w22124", "v": "商品列表页-分页-位置7", "a": "202026-7" },
                { "k": "w22125", "v": "商品列表页-分页-位置8", "a": "202026-8" },
                { "k": "w22126", "v": "商品列表页-分页-位置9", "a": "202026-9" },
                { "k": "w22127", "v": "商品列表页-分页-位置10", "a": "202026-10" },
            ],
            //产品列表-热销推荐
            "202027": [
                { "k": "w22108", "v": "商品列表页-热销推荐1", "a": "202027-1" },
                { "k": "w22109", "v": "商品列表页-热销推荐2", "a": "202027-2" },
                { "k": "w22110", "v": "商品列表页-热销推荐3", "a": "202027-3" },
                { "k": "w22111", "v": "商品列表页-热销推荐4", "a": "202027-4" },
                { "k": "w22112", "v": "商品列表页-热销推荐5", "a": "202027-5" },
                { "k": "w22113", "v": "商品列表页-热销推荐6", "a": "202027-6" },
                { "k": "w22114", "v": "商品列表页-热销推荐7", "a": "202027-7" },
                { "k": "w22115", "v": "商品列表页-热销推荐8", "a": "202027-8" },
                { "k": "w22116", "v": "商品列表页-热销推荐9", "a": "202027-9" },
                { "k": "w22117", "v": "商品列表页-热销推荐10", "a": "202027-10" },
            ],
        },
        //商品详情页
        "101012": {
            //商品详情-操作
            "202042": [
                { "k": "w22198", "v": "商品详情-数量减", "a": "202042-1" },
                { "k": "w22199", "v": "商品详情-数量加", "a": "202042-2" },
                { "k": "w1193", "v": "商品详情-立即购买点击", "a": "202042-3" },
                { "k": "w1192", "v": "商品详情-加入购物车点击", "a": "202042-4" },

                //特殊
                { "k": "w1505", "v": "商品详情页-收藏点击", "a": "202042-span-1" },
                { "k": "w1506", "v": "商品详情页-取消收藏点击", "a": "202042-span-2" },

                { "k": "w1035", "v": "商品详情页-标签-商品详情点击", "a": "202042-li-1" },
                { "k": "w1036", "v": "商品详情页-标签-规格参数点击", "a": "202042-li-2" },
                { "k": "w1588", "v": "商品详情页-标签-常见问题点击", "a": "202042-li-3" },

            ],
            //商品详情-活动(赠品)
            "202047": [
                { "k": "w22200", "v": "商品详情-活动（赠品）-位置1", "a": "202047-1" },
                { "k": "w22201", "v": "商品详情-活动（赠品）-位置2", "a": "202047-2" },
                { "k": "w22202", "v": "商品详情-活动（赠品）-位置3", "a": "202047-2" },
                { "k": "w22203", "v": "商品详情-活动（赠品）-位置4", "a": "202047-3" },
                { "k": "w22204", "v": "商品详情-活动（赠品）-位置5", "a": "202047-4" },
            ],
            //商品详情-选择属性
            "202041": [
                { "k": "w22205", "v": "商品详情-选择属性-位置1", "a": "202041-1" },
                { "k": "w22206", "v": "商品详情-选择属性-位置2", "a": "202041-2" },
                { "k": "w22207", "v": "商品详情-选择属性-位置3", "a": "202041-3" },
                { "k": "w22208", "v": "商品详情-选择属性-位置4", "a": "202041-4" },
                { "k": "w22209", "v": "商品详情-选择属性-位置5", "a": "202041-5" },
                { "k": "w22210", "v": "商品详情-选择属性-位置6", "a": "202041-6" },
                { "k": "w22211", "v": "商品详情-选择属性-位置7", "a": "202041-7" },
                { "k": "w22212", "v": "商品详情-选择属性-位置8", "a": "202041-8" },
                { "k": "w22213", "v": "商品详情-选择属性-位置9", "a": "202041-9" },
                { "k": "w22214", "v": "商品详情-选择属性-位置10", "a": "202041-10" },
                { "k": "w22215", "v": "商品详情-选择属性-位置11", "a": "202041-11" },
                { "k": "w22216", "v": "商品详情-选择属性-位置12", "a": "202041-12" },
                { "k": "w22217", "v": "商品详情-选择属性-位置13", "a": "202041-13" },
                { "k": "w22218", "v": "商品详情-选择属性-位置14", "a": "202041-14" },
                { "k": "w22219", "v": "商品详情-选择属性-位置15", "a": "202041-15" },
            ]
        },
        //品牌汇列表
        "101059": {
            //品牌汇-列表
            "202037": [
                { "k": "w22148", "v": "品牌汇-列表-品牌位置1", "a": "202037-1" },
                { "k": "w22149", "v": "品牌汇-列表-品牌位置2", "a": "202037-2" },
                { "k": "w22150", "v": "品牌汇-列表-品牌位置3", "a": "202037-3" },
                { "k": "w22151", "v": "品牌汇-列表-品牌位置4", "a": "202037-4" },
                { "k": "w22152", "v": "品牌汇-列表-品牌位置5", "a": "202037-5" },
                { "k": "w22153", "v": "品牌汇-列表-品牌位置6", "a": "202037-6" },
                { "k": "w22154", "v": "品牌汇-列表-品牌位置7", "a": "202037-7" },
                { "k": "w22155", "v": "品牌汇-列表-品牌位置8", "a": "202037-8" },
                { "k": "w22156", "v": "品牌汇-列表-品牌位置9", "a": "202037-9" },
                { "k": "w22157", "v": "品牌汇-列表-品牌位置10", "a": "202037-10" },
            ],
            //品牌汇-热销品牌
            "202038": [
                { "k": "w22158", "v": "品牌汇-热销品牌-品牌位置1", "a": "202038-1" },
                { "k": "w22159", "v": "品牌汇-热销品牌-品牌位置2", "a": "202038-2" },
                { "k": "w22160", "v": "品牌汇-热销品牌-品牌位置3", "a": "202038-3" },
                { "k": "w22161", "v": "品牌汇-热销品牌-品牌位置4", "a": "202038-4" },
                { "k": "w22162", "v": "品牌汇-热销品牌-品牌位置5", "a": "202038-5" },
                { "k": "w22163", "v": "品牌汇-热销品牌-品牌位置6", "a": "202038-6" },
                { "k": "w22164", "v": "品牌汇-热销品牌-品牌位置7", "a": "202038-7" },
                { "k": "w22165", "v": "品牌汇-热销品牌-品牌位置8", "a": "202038-8" },
                { "k": "w22166", "v": "品牌汇-热销品牌-品牌位置9", "a": "202038-9" },
                { "k": "w22167", "v": "品牌汇-热销品牌-品牌位置10", "a": "202038-10" },
            ],
            //品牌汇-热销推荐
            "202039": [
                { "k": "w22168", "v": "品牌汇-热销推荐-商品位置1", "a": "202039-1" },
                { "k": "w22169", "v": "品牌汇-热销推荐-商品位置2", "a": "202039-2" },
                { "k": "w22170", "v": "品牌汇-热销推荐-商品位置3", "a": "202039-3" },
                { "k": "w22171", "v": "品牌汇-热销推荐-商品位置4", "a": "202039-4" },
                { "k": "w22172", "v": "品牌汇-热销推荐-商品位置5", "a": "202039-5" },
                { "k": "w22173", "v": "品牌汇-热销推荐-商品位置6", "a": "202039-6" },
                { "k": "w22174", "v": "品牌汇-热销推荐-商品位置7", "a": "202039-7" },
                { "k": "w22175", "v": "品牌汇-热销推荐-商品位置8", "a": "202039-8" },
                { "k": "w22176", "v": "品牌汇-热销推荐-商品位置9", "a": "202039-9" },
                { "k": "w22177", "v": "品牌汇-热销推荐-商品位置10", "a": "202039-10" },
            ]
        },
        //品牌汇详情页面
        "101062": {
            //品牌汇详情-商品列表
            "202040": [
                { "k": "w22178", "v": "品牌汇详情商品列表-商品位置1", "a": "202040-1" },
                { "k": "w22179", "v": "品牌汇详情商品列表-商品位置2", "a": "202040-2" },
                { "k": "w22180", "v": "品牌汇详情商品列表-商品位置3", "a": "202040-3" },
                { "k": "w22181", "v": "品牌汇详情商品列表-商品位置4", "a": "202040-4" },
                { "k": "w22182", "v": "品牌汇详情商品列表-商品位置5", "a": "202040-5" },
                { "k": "w22183", "v": "品牌汇详情商品列表-商品位置6", "a": "202040-6" },
                { "k": "w22184", "v": "品牌汇详情商品列表-商品位置7", "a": "202040-7" },
                { "k": "w22185", "v": "品牌汇详情商品列表-商品位置8", "a": "202040-8" },
                { "k": "w22186", "v": "品牌汇详情商品列表-商品位置9", "a": "202040-9" },
                { "k": "w22187", "v": "品牌汇详情商品列表-商品位置10", "a": "202040-10" },
                { "k": "w22188", "v": "品牌汇详情商品列表-商品位置11", "a": "202040-11" },
                { "k": "w22189", "v": "品牌汇详情商品列表-商品位置12", "a": "202040-12" },
                { "k": "w22190", "v": "品牌汇详情商品列表-商品位置13", "a": "202040-13" },
                { "k": "w22191", "v": "品牌汇详情商品列表-商品位置14", "a": "202040-14" },
                { "k": "w22192", "v": "品牌汇详情商品列表-商品位置15", "a": "202040-15" },
                { "k": "w22193", "v": "品牌汇详情商品列表-商品位置16", "a": "202040-16" },
                { "k": "w22194", "v": "品牌汇详情商品列表-商品位置17", "a": "202040-17" },
                { "k": "w22195", "v": "品牌汇详情商品列表-商品位置18", "a": "202040-18" },
                { "k": "w22196", "v": "品牌汇详情商品列表-商品位置19", "a": "202040-19" },
                { "k": "w22197", "v": "品牌汇详情商品列表-商品位置20", "a": "202040-20" },
            ]
        },
        //购物车页面
        "101045": {
            //购物车-操作
            "202048": [
                { "k": "w1161", "v": "购物车-操作-清除失效商品", "a": "202048-1" },
                { "k": "w1153", "v": "购物车-操作-去结算", "a": "202048-2" },
                { "k": "w1143", "v": "购物车-操作-删除选中的商品", "a": "202048-3" },
                { "k": "w1160", "v": "购物车-操作-去首页", "a": "202048-4" },
                { "k": "w22220", "v": "购物车-操作-登录", "a": "202048-5" },
                { "k": "w1160", "v": "购物车-操作-去首页", "a": "202048-6" },
                //{ "k": "w1160", "v": "购物车默认页-去逛逛点击", "a": "202048-4" },
                //{ "k": "w11025", "v": "购物车默认页-去登录", "a": "202048-5" },
                //{ "k": "w1161", "v": "失效商品页-全部清空点击", "a": "202048-6" },
                { "k": "w1142", "v": "购物车页面-编辑页-全选点击", "a": "202048-input-1" },
                { "k": "w1142", "v": "购物车页面-编辑页-全选点击", "a": "202048-input-2" },
            ],
            //购物车-商品列表
            "202049": [
                { "k": "w1151", "v": "购物车页-商品详情点击", "a": "202049-1" },
                { "k": "w1143", "v": "购物车页面-编辑页-删除点击", "a": "202049-2" },
            ]
        },
        //订单确认页
        "101047": {
            //订单确认页-操作
            "202062": [
                { "k": "", "v": "订单确认页-点击管理收货地址", "a": "202062-1" },
                { "k": "", "v": "订单确认页-点击返回购物车", "a": "202062-2" },
                { "k": "p1167", "v": "订单确认页-点击提交订单", "a": "202062-3" },

                { "k": "w1166", "v": "订单确认页-收货人信息点击", "a": "202062-li" },
                { "k": "", "v": "订单确认页-点击在线支付", "a": "202062-dt-2" },
                { "k": "w1536", "v": "订单确认页-点击货到付款", "a": "202062-dt-3" },
            ],
            //发票
            "202060": [
                { "k": "w1254", "v": "订单确认页-点击不开发票", "a": "202060-input-1" },
                { "k": "w1253", "v": "订单确认页-点击发票信息", "a": "202060-input-2" },
                { "k": "w1259", "v": "发票信息页-点击个人", "a": "202060-input-3" },
                { "k": "w1260", "v": "发票信息页-点击公司", "a": "202060-input-4" },
                { "k": "w1262", "v": "发票信息页-点击发票内容", "a": "202060-input-5" },
            ],
            //支付方式
            "202067": [
                { "k": "w1538", "v": "选择支付方式-支付宝点击", "a": "202067-1" },
                { "k": "w1539", "v": "选择支付方式-微信支付点击", "a": "202067-2" },
                { "k": "w1540", "v": "选择支付方式-货到付款点击", "a": "202067-3" },
            ],
            //商品列表
            "202068": [
                { "k": "", "v": "订单确认页-点击商品详情", "a": "202068" },
            ],
            //优惠劵,暂存款,储值金,积分
            "202059": [
                { "k": "", "v": "使用优惠劵-点击兑换新劵", "a": "202059-1" },
                { "k": "", "v": "使用优惠劵-点击查看全部优惠券", "a": "202059-2" },
                { "k": "w1491", "v": "使用优惠劵-点击兑换", "a": "202059-3" },

                { "k": "w1490", "v": "订单确认-点击优惠券", "a": "202059-input-1" },
                { "k": "", "v": "订单确认-点击输入优惠劵", "a": "202059-input-2" },
                { "k": "", "v": "订单确认-点击暂存款", "a": "202059-input-3" },
                { "k": "", "v": "订单确认-点击输入暂存款", "a": "202059-input-4" },
                { "k": "", "v": "订单确认-点击储值金", "a": "202059-input-5" },
                { "k": "", "v": "订单确认-点击输入储值金", "a": "202059-input-6" },
                { "k": "", "v": "订单确认-点击积分", "a": "202059-input-7" },
                { "k": "", "v": "订单确认-点击输入积分", "a": "202059-input-8" },

            ]
        },
        //我的主页
        "101014": {
            "202038": [
                { "k": "", "v": "我的主页-点击设置个人信息", "a": "202038-1" },
                { "k": "w1484", "v": "我的主页-点击修改密码", "a": "202038-2" },
                { "k": "w1483", "v": "我的主页-点击编辑收货地址", "a": "202038-3" },
                { "k": "w1055", "v": "我的主页-我的订单点击", "a": "202038-4" },
            ]
        },
        //我的订单列表页
        "101043": {
            //我的订单列表页-操作
            "202069": [
                { "k": "w1199", "v": "我的订单-全部点击", "a": "202069-li-1" },
                { "k": "w1203", "v": "我的订单-交易成功点击", "a": "202069-li-2" },
                { "k": "", "v": "我的订单-交易失败点击", "a": "202069-li-3" },
                { "k": "w1202", "v": "我的订单-待收货点击", "a": "202069-li-4" },
                { "k": "w1200", "v": "我的订单-待付款点击", "a": "202069-li-5" },
                { "k": "w1201", "v": "我的订单-待发货点击", "a": "202069-li-6" },


            ],
            //我的订单列表页-订单列表-操作
            "202070": [
                { "k": "", "v": "我的订单-订单详情点击", "a": "202070-1" },
                { "k": "w1204", "v": "我的订单-取消订单点击", "a": "202070-2" },
                { "k": "w1207", "v": "我的订单-付款点击", "a": "202070-3" },
                { "k": "w1226", "v": "我的订单-点击查看物流", "a": "202070-4" },
                { "k": "w1209", "v": "我的订单-电话退款点击", "a": "202070-5" },
                { "k": "w1208", "v": "我的订单-确认收货点击", "a": "202070-6" },
                { "k": "w1577", "v": "我的订单-删除订单按钮点击", "a": "202070-7" },

                { "k": "w1210", "v": "我的订单-电话退款/售后点击", "a": "202070-8" },
                { "k": "w1522", "v": "我的订单-订单咨询", "a": "202070-9" },
                { "k": "w1767", "v": "我的订单页-评价晒单按钮点击", "a": "202070-10" },
            ],
            //我的订单列表页-订单列表-商品
            "202071": [
                { "k": "p1211", "v": "我的订单-商品点击", "a": "202071" },
            ]
        },
        //订单详情页
        "101044": {
            //订单详情页-操作
            "202072": [
                { "k": "", "v": "订单详情页", "a": "202072-1" },
                { "k": "w1135", "v": "订单详情页-取消订单点击", "a": "202072-2" },
                { "k": "w1134", "v": "订单详情页-付款点击", "a": "202072-3" },
                { "k": "w1227", "v": "订单详情页-点击查看物流", "a": "202072-4" },
                { "k": "w1137", "v": "订单详情页-电话退款点击", "a": "202072-5" },
                { "k": "w1138", "v": "订单详情页-确认收货点击", "a": "202072-6" },
                { "k": "w1585", "v": "订单详情页-删除订单按钮点击", "a": "202072-7" },

                { "k": "w1139", "v": "订单详情页-电话退款/售后点击", "a": "202072-8" },
                { "k": "w1522", "v": "订单详情页-订单咨询", "a": "202072-9" },
                { "k": "w1768", "v": "订单详情页-评价晒单按钮点击", "a": "202072-10" },
                { "k": "w1140", "v": "订单详情页-客服电话点击", "a": "202072-11" },
                { "k": "w1141", "v": "订单详情页-客服电话取消点击", "a": "202072-12" },
                { "k": "w1537", "v": "订单详情页-点击支付方式", "a": "202072-13" },

            ],
            //订单详情页-商品列表
            "202073": [
                { "k": "w1228", "v": "订单详情页-点击物流信息", "a": "202073-1" },
                { "k": "w1133", "v": "订单详情页-商品详情点击", "a": "202073" },
            ]
        },
        //我的收藏
        "101068": {
            //我的收藏-商品列表
            "202058": [
                { "k": "w1508", "v": "我的收藏-商品点击", "a": "202058-1" },
                { "k": "w", "v": "我的收藏-商品详情点击", "a": "202058-2" },
                { "k": "w1510", "v": "我的收藏-取消关注点击", "a": "202058-3" },
            ]
        },
        //浏览记录
        "101016": {
            //浏览记录页面-产品列表
            "202040": [
                { "k": "w1074", "v": "浏览记录-商品点击", "a": "202040-1" },
                { "k": "w", "v": "浏览记录-商品详情点击", "a": "202040-2" },
                { "k": "", "v": "浏览记录-取消关注点击", "a": "202040-3" },
            ]
        },
        //我的优惠劵
        "101064": {
            //我的优惠劵-操作
            "202054": [
                { "k": "w1485", "v": "我的优惠劵-点击未使用", "a": "202054-li-1" },
                { "k": "w1486", "v": "我的优惠劵-点击历史", "a": "202054-li-2" },
                { "k": "w1488", "v": "我的优惠券-点击兑换优惠券", "a": "202054-3" },
            ],
            //兑换优惠券-操作
            "202056": [
                { "k": "w1489", "v": "兑换优惠券-点击兑换", "a": "202056-1" },
            ],
            //我的优惠劵-说明
            "202055": [
                { "k": "p1527", "v": "我的优惠劵-点击使用范围说明按钮展开", "a": "202055" },
                { "k": "p1528", "v": "我的优惠劵-点击使用范围说明按钮收起", "a": "202055" },
            ]
        },
        //管理地址页
        "101052": {
            //管理收货地址页-操作
            "202042": [
                { "k": "w1232", "v": "管理收货地址页-点击添加新地址", "a": "202042-1" },
            ],
            //管理收货地址页-列表
            "202043": [
                { "k": "", "v": "管理收货地址页-设置默认", "a": "202043-1" },
                { "k": "w1233", "v": "管理收货地址页-点击编辑地址", "a": "202043-2" },
                { "k": "w1235", "v": "管理收货地址页-地址删除", "a": "202043-3" },
            ],
            //修改收货地址页-操作
            "202041": [
                { "k": "w1245", "v": "修改默认收货地址页-点击关闭", "a": "202041-1" },
                { "k": "w1243", "v": "修改默认收货地址页-点击保存", "a": "202041-2" },
                //{ "k": "p1241", "v": "修改收货地址页-点击删除收货地址", "a": "202041-div-1" },
            ]
        },
        //设置密码页
        "101005": {
            "202035": [
                { "k": "w1009", "v": "设置密码页-保存点击", "a": "202035-1" },
                //特殊
                { "k": "w1005", "v": "设置密码页-获取验证码点击", "a": "202035-button-1" },
                // { "k": "p11124", "v": "设置密码页-点击图片验证码", "a": "202035-img-2" },
            ]
        },
        //支付成功
        "101089": {
            //支付成功-操作
            "202063": [
                { "k": "w1607", "v": "支付成功页-查看订单点击", "a": "202063-1" },
            ],
        },
        //支付失败
        "101090": {
            //支付失败-操作
            "202065": [
                { "k": "w1609", "v": "支付失败-查看订单点击", "a": "202065-1" },
            ]
        },
        //新增页面
        //秒杀
        "102003": {
            //秒杀-商品列表
            "202081": [
                { "k": "w11062", "v": "秒杀-点击商品", "a": "202081" },
            ]
        },
        //阶梯价秒杀
        "102004": {
            //阶梯价秒杀-商品列表
            "202087": [
                { "k": "w11064", "v": "阶梯价秒杀-点击商品", "a": "202087" },
            ]
        },
        //阶梯数量秒杀
        "102005": {
            //阶梯数量秒杀-商品列表
            "202089": [
                { "k": "w11066", "v": "阶梯数量秒杀-点击商品", "a": "202089" },
            ]
        },
    };
    //除a标签以外的部分页面部分模块下面的特殊标签添加埋点
    map.special = {
        //TV直播页
        "101009": {
            //时间点击
            "202017": [
                { taget: "li", style: "", name: "", id: "" },
            ]
        },
        //登录页
        "101013": {
            "202019": [
                { taget: "button", style: "", name: "", id: "btnCode" },
                { taget: "label", style: "", name: "", id: "" }
            ]
        },
        //注册页
        "101003": {
            "202020": [
                { taget: "button", style: "", name: "", id: "btnCode" },
                { taget: "label", style: "", name: "", id: "" }
            ]
        },
        //查询列表页
        "101010": {
            "202024": [
                { taget: "li", style: "", name: "", id: "" }
            ]
        },
        //商品详情页
        "101012": {
            "202042": [
                { taget: "span", style: "", name: "", id: "sc" },
                { taget: "li", style: "", name: "", id: "" }
            ]
        },
        //购物车
        "101045": {
            //操作
            "202048": [
                { taget: "input", style: "", name: "", id: "cbseletall_foot" },
                { taget: "input", style: "", name: "", id: "cbseletall_top" },
            ]
        },
        //我的订单列表页
        "101043": {
            //操作
            "202069": [
                { taget: "li", style: "", name: "", id: "" },
            ]
        },
        //订单确认页
        "101047": {
            //操作
            "202062": [
                { taget: "li", style: "", name: "", id: "" },
                { taget: "dt", style: "", name: "", id: "zxzf" },
                { taget: "dt", style: "", name: "", id: "hdfk" },
            ],
            //发票
            "202060": [
                { taget: "input", style: "", name: "", id: "" },
            ],
            //优惠劵,暂存款,储值金,积分
            "202059": [
                { taget: "input", style: "", name: "", id: "" },
            ],
        },
        //我的优惠卷
        "101064": {
            //操作
            "202054": [
                { taget: "li", style: "", name: "", id: "" },
            ],
        },
        //设置密码页
        "101005": {
            //操作
            "202035": [
                { taget: "button", style: "", name: "", id: "btn_getsmscode" },
            ],
        },

    };
    //动态模块
    map.dynamicModule = {
        //"101006": {
        //    "column-left clearfix": "202006",
        //    "column-right clearfix": "202007"
        //},
    };
    el.elements = [];
    el.specialElements = [];
    //初始化页面埋点标签序号
    el.initElement = function () {

        el.dynamicModuleInit();

        var arr = w.document.getElementsByTagName("a");
        el.elements = arr;
        var length = el.elements.length;
        var groups = [];
        var modules = map.mapping[op.page];
        //通用模块
        var commonModules = map.mapping["200000"];
        //合并页面模块和通用模块
        extend(modules, commonModules);
        var group = [];
        //对页面标签进行分组
        for (var k in modules) {
            var data = { module: k, arr: [] };
            for (var i = 0; i < length; i++) {
                var element = el.elements[i];
                el.isSuc = false;
                el.math(k, element);
                if (el.isSuc) {
                    data.arr.push(element);
                }
            }
            group.push(data);
        }
        var gl = group.length;
        //对页面标签初始化埋点ID
        for (var k = 0; k < gl; k++) {
            var mk = group[k].module;
            var arr = group[k].arr;
            var al = arr.length;
            for (var i = 0; i < al; i++) {
                var element = arr[i];
                element.setAttribute("num", mk + "-" + (i + 1));
            }
        }
        //特殊标签处理
        var specials = map.special[op.page];
        var selarr = [];
        var setarr = [];
        for (var k in specials) {
            var elements = specials[k];
            var l = 0;
            for (var i = 0; i < elements.length; i++) {
                var ele = elements[i];
                var eles = [];
                setarr = [];
                if (ele.id != "") {
                    var e = w.document.getElementById(ele.id);
                    if (e) {
                        e.setAttribute("num", k + "-" + ele.taget + "-" + (i + 1));
                        selarr.push(e);
                    }
                }
                if (ele.name != "") {
                    eles = w.document.getElementsByName(ele.name);
                }
                if (ele.style != "") {
                    eles = w.document.getElementsByClassName(ele.style);
                }
                if (ele.id == "" && ele.style == "" && ele.name == "") {
                    eles = w.document.getElementsByTagName(ele.taget);
                }
                for (var j = 0; j < eles.length; j++) {
                    var e = eles[j];
                    el.isSuc = false;
                    el.math(k, e);
                    if (el.isSuc) {
                        setarr.push(e);
                        selarr.push(e);
                    }
                }
                l = setarr.length;
                for (var j = 0; j < l; j++) {
                    var e = setarr[j];
                    e.setAttribute("num", k + "-" + e.tagName.toLowerCase() + "-" + (j + 1));
                }
            }
        }
        el.specialElements = selarr;
    };
    //动态分配特殊模块id
    el.dynamicModuleInit = function () {
        //首页 左右两栏
        //if (op.page == "101006") {
        //    var modules = map.dynamicModule[op.page];
        //    for (var k in modules) {
        //        var eles = w.document.getElementsByClassName(k);
        //        var lenght = eles.length;
        //        for (var i = 0; i < lenght; i++) {
        //            var e = eles[i];
        //            el.setdynamicModule(modules[k], e);
        //        }
        //    }
        //}
    };

    el.dealSpecialElement = function (num, element) {
        //特别标签处理
        //查询列表页-价格
        if (num == "202024-li-4") {
            var sortflag = element.getAttribute("data-sortflag");
            if (sortflag == "1") {
                return "202024-li-4-1";
            }
            else {
                return "202024-li-4-2";
            }
        }
        //商品详情页收藏
        if (num == '202042-span-1') {
            var style = element.getAttribute("class");
            if (style == "curr") {
                return "202042-span-2";
            }
            else {
                return "202042-span-1";
            }
        }
        return num;
    };
    //初始化标签事件
    el.initEvent = function (arr) {
        var length = arr.length;
        for (var i = 0; i < length; i++) {
            var element = arr[i];
            el.addListener(element, "click", function (e) {

                var obj = e.currentTarget || e.target || e.srcElement;
                var n = obj.tagName.toLowerCase();
                var m = map.get(obj);
                if (m) {
                    //用户点击数据处理
                    var current = db.get(db.type.current);
                    var page = db.get(db.type.page);

                    db.current.fromparent = current.currentpage;
                    db.current.customevent = m.k;
                    db.current.currenttime = new Date().getTime();
                    db.current.savetype = "sendEnd";
                    db.current.fromevent = current.customevent;
                    db.current.frompage = page.parentpage;

                    db.set(db.type.current, db.current);
                    db.add(db.current);

                    db.submit();
                }
            });
        }
    };
    //匹配成功标识
    el.isSuc = false;
    //匹配标签ele是否属于module模块
    el.math = function (mk, ele) {
        var parent = ele.parentNode;
        var n = parent.tagName.toLowerCase();
        if (n == "body") {
            return false;
        }
        var moduleId = parent.getAttribute("module");
        if (moduleId) {
            if (mk == moduleId) {
                el.isSuc = true;
            }
        }
        else {
            el.math(mk, parent);
        }
    };
    el.setdynamicModule = function (mk, ele) {
        var parent = ele.parentNode;
        var n = parent.tagName.toLowerCase();
        if (n == "body") {
            return false;
        }
        var moduleId = parent.getAttribute("module");
        if (moduleId) {
            parent.setAttribute("module", mk);
        }
        else {
            el.mathGetModule(mk, parent);
        }
    };
    el.contain = function (n) {
        for (var i in el.types) {
            if (el.types[i] == n) {
                return 1;
            }
        }
        return 0;
    };
    //添加监听事件
    el.addListener = function (element, type, listener, useCapture) {
        if (element.addEventListener) {
            element.addEventListener(type, listener, !!useCapture);
        } else {
            element.attachEvent && element.attachEvent("on" + type, listener);
        }
    };

    //数据存储
    db = {};
    //类型
    db.type = {
        "original": "original",
        "copy": "copy",
        "current": "current",
        "page": "page"
    };
    //当前数据
    db.current = {
        "29": "customevent",
        "fromparent": "",
        "customevent": "",
        "currenttime": "",
        "savetype": "sendEnd",
        "fromevent": "",
        "frompage": "",
    };
    db.page = {
        "currentpage": "",
        "parentpage": "",
    };
    //添加
    db.add = function (data) {
        var arr = db.getArr(db.type.original);
        arr.push(data);
        db.set(db.type.original, arr);
    };
    //设置
    db.set = function (k, v) {
        if (w.localStorage) {
            var va = w.JSON.stringify(v);
            w.localStorage.setItem(k, va);
        }
    };
    //获取（Object）
    db.get = function (t) {
        var q = {};
        if (w.localStorage) {
            var a = w.localStorage.getItem(t);
            if (a) {
                q = w.JSON.parse(a);
            }
        }
        return q;
    };
    //获取（Array）
    db.getArr = function (t) {
        var q = [];
        if (w.localStorage) {
            var a = w.localStorage.getItem(db.type[t]);
            if (a) {
                q = w.JSON.parse(a);
            }
        }
        return q;
    };
    //复制
    db.copy = function () {
        var source = db.getArr(db.type.original);
        var copy = db.getArr(db.type.copy);
        copy = arrExtend(copy, source);
        db.set(db.type.copy, copy);
        db.remove(db.type.original);

    };
    //删除
    db.remove = function (t) {
        if (w.localStorage) {
            w.localStorage.removeItem(t);
        }
    };
    //源数据条数
    db.count = function () {
        var arr = db.getArr(db.type.original);
        if (arr) {
            return arr.length;
        }
        return 0;
    };
    //ajax
    db.ajax = function (conf) {
        var r = window.XMLHttpRequest ? new XMLHttpRequest() : new ActiveXObject("microsoft.xmlhttp");
        if (!conf.type) {
            conf.type = "get";
        }
        if (!conf.async) {
            conf.async = true;
        }
        if (!conf.dataType) {
            conf.dataType = "text";
        }
        if (!conf.data) {
            conf.data = null;
        }
        if (!conf.timeout) {
            conf.timeout = 5;
            var timmer = w.setTimeout(function () {
                r.abort();
                db.copy();
            }, conf.timeout * 1000);
        }
        try {
            r.open(conf.type, conf.url, conf.async);
            if (conf.type.toLowerCase() == "post") {
                r.setRequestHeader("content-type",
                    "application/x-www-form-urlencoded");
            }
            r.send(conf.data);
            r.onreadystatechange = function () {
                if (r.readyState == 4 && r.status == 200) {
                    if (timmer) {
                        clearTimeout(timmer);
                    }
                    if (conf.dataType.toLowerCase() == "text") {
                        if (conf.success && typeof conf.success == "function") {
                            conf.success(JSON.parse(r.responseText));
                        }
                    }
                    if (conf.dataType.toLowerCase() == "json") {
                        if (conf.success && typeof conf.success == "function") {
                            conf.success(JSON.parse(r.responseText));
                        }
                    }
                    else {
                        if (conf.success && typeof conf.success == "function") {
                            conf.success(r.responseText);
                        }
                    }
                }
                else if (r.readyState == 4 && r.status != 200) {
                    r.abort();
                    db.copy();
                }
            };
        }
        catch (ex) {
            r.abort();
            db.copy();
        }
    };
    //伪ajax
    db.fakeAjax = function (conf) {
        var img = new Image();
        img.src = conf.url + "?" + conf.data;
    };
    //提交
    db.submit = function () {
        if (db.count() >= 100) {
            var d = db.getArr(db.type.original);
            var c = db.getArr(db.type.copy);
            c = arrExtend(c, d);
            var dataObj = {
                "37": c,
                "36": {
                    "10": "",
                    "2": "",
                    "15": "",
                    "3": "SI2003",
                    "11": "GMT 8",
                    "4": "",
                    "16": "",
                    "5": "",
                    "12": "",
                    "17": "",
                    "6": "web",
                    "13": "",
                    "7": "",
                    "8": "",
                    "14": "",
                    "1": new Date().getTime(),
                    "9": ""
                }
            }
            var input = {
                "version": "",
                "dataString": dataObj
            };
            db.ajax({
                url: "/Ajax/API.aspx",
                data: "action=gas&api_input=" + JSON.stringify(input) + "&api_target=com_cmall_groupcenter_account_api_ApiTemporaryCount",
                type: "post",
                success: function (msg) {
                    if (msg.resultCode == "1") {
                        db.remove(db.type.original);
                        db.remove(db.type.copy);
                    }
                    else {
                        db.copy();
                    }
                }
            });
        }
    };
    //对数据进行初始化
    (db.init = function () {
        var p = db.get(db.type.current);
        if (!p.childId) {
            p = db.current;
            db.set(db.type.current, p);
        }
        var page = db.get(db.type.page);
        var cp = db.page;
        if (!page.currentpage) {
            cp.currentpage = op.page;
            cp.parentpage = "";
        }
        else {
            cp.currentpage = op.page;
            cp.parentpage = page.currentpage;
        }
        db.set(db.type.page, cp);
    })();
    //主程序
    main.init = function () {
        el.initElement();
        el.initEvent(el.elements);
        el.initEvent(el.specialElements);
        w.clearTimeout(timmerMain);
    };
    var timmerMain = w.setTimeout(function () {
        main.init();
    }, 3000);
})(window);